6_semester/КИСП/Курсовая/src/Documents/ЗаказУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказУслуги</Name>
			<BasedOn>
				<xr:Item>Document.СеансБронирования</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
				<xr:Item>AccumulationRegister.ВыручкаИВремя</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/ЗаказУслуги/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СеансБронирования") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Компьютер = ДанныеЗаполнения.Компьютер;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// Создаем задачу исполнителя
	НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	НоваяЗадача.Наименование = "Заказ услуги: " + Строка(Номенклатура);
	НоваяЗадача.Дата = Дата;
	НоваяЗадача.Основание = Ссылка;
	
	// Назначаем исполнителя (без жесткой привязки к точке маршрута БП, чтобы не вызывать зацикливание)
	НоваяЗадача.Должность = Справочники.Должности.НайтиПоНаименованию("Администратор");
	
	НоваяЗадача.Записать();
КонецПроцедуры

Процедура ЗавершитьЗаказ() Экспорт
	Если Завершен Тогда Возврат; КонецЕсли;
	
	// Создаем продажу товаров
	ДокПродажа = Документы.ПродажаТоваров.СоздатьДокумент();
	ДокПродажа.Дата = ТекущаяДата();
	ДокПродажа.Клиент = Клиент;
	
	НоваяСтрока = ДокПродажа.Товары.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = Количество;
	НоваяСтрока.Цена = Цена;
	НоваяСтрока.Сумма = Сумма;
	
	ДокПродажа.Записать(РежимЗаписиДокумента.Проведение);
	
	// Создаем оплату
	ДокОплата = Документы.Оплата.СоздатьДокумент();
	ДокОплата.Дата = ТекущаяДата();
	ДокОплата.Клиент = Клиент;
	ДокОплата.Сумма = Сумма;
	ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
	
	Завершен = Истина;
	Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры
